# project.org

*** julie_description
CLOCK: [2015-11-25 三 14:39]--[2015-11-25 三 14:49] =>  0:10

**** urdf

#+BEGIN_SRC sh :results output :exports both
ls -l ~/Wally/Project/catkin_ws/src/julie/julie_description
#+END_SRC

#+RESULTS:
: 总用量 24
: -rw-rw-r-- 1 ben ben  111 11月 25 14:34 CMakeLists.txt
: drwxrwxr-x 2 ben ben 4096 11月 27 16:44 launch
: drwxrwxr-x 2 ben ben 4096 11月 27 16:46 meshes
: -rw-rw-r-- 1 ben ben  435 11月 25 14:20 package.xml
: drwxrwxr-x 2 ben ben 4096 11月 26 19:59 test
: drwxrwxr-x 2 ben ben 4096 11月 26 22:41 urdf

**** DONE 测试卡片电脑连接 IMU
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-03-04 五 15:51]
- State "NEXT"       from ""           [2016-03-04 五 10:13] \\
  阅读手册，直接通过串口连接 IMU
CLOCK: [2016-03-04 五 09:40]--[2016-03-04 五 10:13] =>  0:33
:END:

1. 安装 ros-indigo-microstrain-3dmgx2-imu OK

2. 测试连接

   1) 卡片电脑，无 /dev/ttyUSB0
   2) 台式机，有 /dev/ttyUSB0, 说明 IMU 连线不存在问题, ROS 节点读取数
      据亦OK
   3) 使用 usb-serial 转接
      - 驱动预安装，OK
        #+BEGIN_EXAMPLE
        Bus 002 Device 002: ID 1a86:7523 QinHeng Electronics HL-340 USB-Serial adapter
        #+END_EXAMPLE
      - 连接 IMU，读出 /dev/ttyUSB0 !!!
   4) OK

3. 测试 ROS 节点，OK

   - IMU 初始化大约需要 20s

4. 关闭节点以及 Ros master 后，IMU 显示依然在读取数据？？

   - 原因是切换到后台后 使用 kill 关闭，可能导致不完全
   - 在前台关闭则没有出现类似情况
   - 切换到前台关闭也 OK

5. 通过串口直接连接IMU

   查看串口设备
   #+BEGIN_EXAMPLE
   dmesg | grep ttyS*
   #+END_EXAMPLE

   经测为 ttyS1

   通过远程连接有如下 warning

   #+BEGIN_EXAMPLE
     [ WARN] [1457077522.141754754]: Exception thrown while trying to get the IMU reading. This sometimes happens due to a communication glitch, or if another process is trying to access the IMU port. You may try 'lsof|grep /dev/ttyS1' to see if other processes have the port open. invalid checksum.
     Make sure the IMU sensor is connected to this computer. (in microstrain_3dmgx2_imu::IMU:receive)
   #+END_EXAMPLE

**** NEXT ttyUSB 是什么？以及 IMU 手册阅读
:LOGBOOK:
- State "NEXT"       from "TODO"       [2016-03-04 五 10:50] \\
  没有搞明白
CLOCK: [2016-03-04 五 10:24]--[2016-03-04 五 10:50] =>  0:26
:END:

**** TCB UTM30LX-EW 连接测试
:LOGBOOK:
- State "TCB"        from "NEXT"       [2016-03-04 五 14:50] \\
  下一步通过文件自动配置网络，而不是使用GUI手动配置
- State "NEXT"       from ""           [2016-03-04 五 11:50] \\
  暂时没有成功
CLOCK: [2016-03-04 五 11:03]--[2016-03-04 五 11:49] =>  0:46
:END:

http://answers.ros.org/question/212527/hokuyo-utm-30lx-ew-laser-scanner-problems-to-detect/

卡片电脑未关闭系统直接断电(误操作)后，再上电，电脑直接启动，未短路触发。

1. 安装 urg_node, OK
2. ping not ok
3. IP 配置


*配置的是 eth0 的 IP，掩码和路由，与 wlan0 无关（独立）*

- IP: 192.168.0.15
- Mask: 255.255.255.0
- GateWay： 192.168.0.1

通过GUI配置有线网络连接 OK

***** 搭建 Git 本地服务器

文件传输： NFS vs Git

*Of course git*

#+BEGIN_EXAMPLE
  ssh: connect to host localhost port 22: Connection refused
  fatal: Could not read from remote repository.

  Please make sure you have the correct access rights
#+END_EXAMPLE

没有安装 openssh-server


输入密码后 permission denied

检查 git 用户 shell 设置

#+BEGIN_SRC sh
cat /etc/passwd | grep git
#+END_SRC

#+RESULTS:
| git:x:1001:1001:git |   |   | :/home/git:/usr/local/bin/git-shell |

git-shell 的路径是否正确

*** make 入门
- State "TOBECONTINED" from ""           [2015-11-23 一 17:25]
CLOCK: [2015-11-20 五 18:31]--[2015-11-20 五 19:43] =>  1:12
CLOCK: [2015-11-20 五 10:12]--[2015-11-20 五 11:24] =>  1:12

